
#Над входной таблицей провести ряд преобразований:

# Удалить пустые столбцы.
#  Удалить пустые строки.
#   Преобразовать содержимое ячеек по примерам.
#    Транспонировать таблицу.
#

table = [
    [None,"Нумберг, А.Ч.", "2003-09-26", "numberg91@yandex.ru", "(466) 780-61-27"],
    [None,"Мелич, Н.Т.", "2000-09-26", "melic15@gmail.com", "(367) 085-68-88"],
    [None,"Занодий, И.Ч.","2000-08-13 ", "zanodij15@yandex.ru", "(938) 945-95-11"]
    [None,"Зимашяк, Е.Л.", "1999-03-25", "zimasak51@rambler.ru", "(427) 142-80-18"]
         ]